docs/fileing files/ECF Operations/NotifyFilingReviewComplete/NFRC Samples/Madera Phase 3/CC-Reject-NFRC1-ClerkAction.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns70:NotifyFilingReviewCompleteRequestMessage xmlns:ns1="http://niem.gov/niem/structures/2.0" xmlns:ns10="urn:com.journaltech:ecourt:ecf:extension:CaseParticipantExt" xmlns:ns11="urn:com.journaltech:ecourt:ecf:extension:CaseAssignmentType" xmlns:ns12="urn:com.journaltech:ecourt:ecf:extension:FilingIdentityType" xmlns:ns13="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:ns14="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:ns15="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:ns16="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:ns17="urn:com.journaltech:ecourt:ecf:extension:CaseQueryMessageTypeExt" xmlns:ns18="urn:com.journaltech:ecourt:ecf:extension:CourtEventDocumentTypeExt" xmlns:ns19="urn:com.journaltech:ecourt:ecf:extension:CourtEventTypeExt" xmlns:ns2="http://niem.gov/niem/niem-core/2.0" xmlns:ns20="urn:com.journaltech:ecourt:ecf:extension:ContactValue" xmlns:ns21="urn:com.journaltech:ecourt:ecf:extension:CourtEventJudgment" xmlns:ns22="urn:com.journaltech:ecourt:ecf:extension:RelatedCaseType" xmlns:ns23="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:AppellateCase-4.0" xmlns:ns24="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DomesticCase-4.0" xmlns:ns25="http://niem.gov/niem/domains/screening/2.0" xmlns:ns26="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:BankruptcyCase-4.0" xmlns:ns27="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CitationCase-4.0" xmlns:ns28="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ReviewFilingCallbackMessage-4.0" xmlns:ns29="urn:com.journaltech:ecourt:ecf:extension:FilingStatusReason" xmlns:ns3="http://niem.gov/niem/domains/jxdm/4.0" xmlns:ns30="urn:com.journaltech:ecourt:ecf:extension:ReviewedDocumentType" xmlns:ns31="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingStatus" xmlns:ns32="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationTypeExt" xmlns:ns33="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:ns34="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns35="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:ns36="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentReceiptMessage-4.0" xmlns:ns37="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceReceiptMessage-4.0" xmlns:ns38="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:JuvenileCase-4.0" xmlns:ns39="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:ns4="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:ns40="urn:com.journaltech:ecourt:ecf:extension:FilingListQueryMessageTypeExt" xmlns:ns41="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:ns42="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:ns43="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseQueryMessage-4.0" xmlns:ns44="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseListQueryMessage-4.0" xmlns:ns45="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FeesCalculationResponseMessage-4.0" xmlns:ns46="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationResponseMessageTypeExt" xmlns:ns47="urn:com.journaltech:ecourt:ecf:extension:FilingListResponseMessageTypeExt" xmlns:ns48="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingListResponseMessage-4.0" xmlns:ns49="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CourtPolicyResponseMessage-4.0" xmlns:ns5="http://niem.gov/niem/ansi-nist/2.0" xmlns:ns50="http://www.w3.org/2000/09/xmldsig#" xmlns:ns51="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceInformationResponseMessage-4.0" xmlns:ns52="urn:com.journaltech:ecourt:ecf:extension:DocumentResponseMessageTypeExt" xmlns:ns53="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:RecordDocketingMessage-4.0" xmlns:ns54="urn:com.journaltech:ecourt:ecf:extension:RecordDocketingMessageTypeExt" xmlns:ns55="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:AppInfo-4.0" xmlns:ns56="urn:com.journaltech:ecourt:ecf:extension:NFRCResponseType" xmlns:ns57="urn:com.journaltech:ecourt:ecf:extension:CodeValue" xmlns:ns59="urn:com.journaltech:ecourt:ecf:extension:ZipCodeValue" xmlns:ns6="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CriminalCase-4.0" xmlns:ns60="urn:com.journaltech:ecourt:ecf:extension:AttorneyValue" xmlns:ns61="urn:com.journaltech:ecourt:ecf:extension:NFRCRequestType" xmlns:ns62="urn:com.journaltech:ecourt:ecf:extension:RecordingStatusResponseMessage" xmlns:ns63="http://niem.gov/niem/appinfo/2.0" xmlns:ns64="urn:com.journaltech:ecourt:ecf:extension:RecordingStatusQueryMessage" xmlns:ns65="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FeesCalculationQueryMessage-4.0" xmlns:ns66="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationQueryMessageTypeExt" xmlns:ns67="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseListResponseMessage-4.0" xmlns:ns68="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingStatusResponseMessage-4.0" xmlns:ns69="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseResponseMessage-4.0" xmlns:ns7="urn:com.journaltech:ecourt:ecf:extension:TelephoneNumberExt" xmlns:ns70="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:ns71="urn:com.journaltech:ecourt:ecf:extension:EfmFilingReference" xmlns:ns72="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DocumentQueryMessage-4.0" xmlns:ns73="urn:com.journaltech:ecourt:ecf:extension:ServiceInformationQueryMessageTypeExt" xmlns:ns74="http://docs.oasis-open.org/codelist/ns/genericode/1.0/" xmlns:ns75="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingListQueryMessage-4.0" xmlns:ns76="urn:com.journaltech:ecourt:ecf:extension:ServiceInformationResponseMessageTypeExt" xmlns:ns77="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceInformationQueryMessage-4.0" xmlns:ns78="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:RecordDocketingCallbackMessage-4.0" xmlns:ns79="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DocumentResponseMessage-4.0" xmlns:ns8="urn:com.journaltech:ecourt:ecf:extension:NANPTelephoneNumberExt" xmlns:ns80="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:MessageReceiptMessage-4.0" xmlns:ns81="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingStatusQueryMessage-4.0" xmlns:ns82="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CourtPolicyQueryMessage-4.0" xmlns:ns9="urn:com.journaltech:ecourt:ecf:extension:StructuredAddressExt"><ns4:SendingMDELocationID><ns2:IdentificationID>https://overindulgent-finnicky-lavette.ngrok-free.dev/api/efiling/nfrc</ns2:IdentificationID></ns4:SendingMDELocationID><ns28:ReviewFilingCallbackMessageExt><ns2:DocumentIdentification><ns2:IdentificationID>AUTOREJECT-3efdcfb926a84ec9a51cc1d4e52d3a2a</ns2:IdentificationID><ns2:IdentificationCategoryText>FILING_ASSEMBLY_MDE</ns2:IdentificationCategoryText></ns2:DocumentIdentification><ns2:DocumentIdentification><ns2:IdentificationID>26MA00004477</ns2:IdentificationID><ns2:IdentificationCategoryText>FILING_REVIEW_MDE</ns2:IdentificationCategoryText></ns2:DocumentIdentification><ns2:DocumentIdentification><ns2:IdentificationID/><ns2:IdentificationCategoryText>COURT_RECORD_MDE</ns2:IdentificationCategoryText></ns2:DocumentIdentification><ns16:CivilCaseExt ns1:id="66090"><ns2:ActivityStatus><ns2:StatusText/><ns2:StatusDescriptionText/></ns2:ActivityStatus><ns2:CaseTitleText>TBD</ns2:CaseTitleText><ns2:CaseCategoryText>212120</ns2:CaseCategoryText><ns2:CaseDocketID/><ns4:CaseAugmentation><ns10:CaseParticipantExt xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:id="caseAssignment-79395" xsi:type="ns11:CaseAssignmentType"><ns2:EntityPerson ns1:id="103460" xsi:type="ns4:PersonType"><ns2:PersonName><ns2:PersonGivenName>Felicia</ns2:PersonGivenName><ns2:PersonMiddleName>A</ns2:PersonMiddleName><ns2:PersonSurName>Espinosa</ns2:PersonSurName><ns2:PersonNameSuffixText/></ns2:PersonName><ns2:PersonOtherIdentification><ns2:IdentificationID>267198</ns2:IdentificationID><ns2:IdentificationCategoryText>BAR</ns2:IdentificationCategoryText></ns2:PersonOtherIdentification></ns2:EntityPerson><ns4:CaseParticipantRoleCode>ATT</ns4:CaseParticipantRoleCode><ns2:ContactInformation><ns2:ContactMeans xsi:type="ns2:AddressType"><ns2:StructuredAddress xsi:type="ns9:StructuredAddressExt"><ns2:AddressDeliveryPoint xsi:type="ns2:StreetType"><ns2:StreetFullText>2115</ns2:StreetFullText><ns2:StreetFullText>Kern St</ns2:StreetFullText></ns2:AddressDeliveryPoint><ns2:LocationCityName>Fresno</ns2:LocationCityName><ns2:LocationState xsi:type="ns2:ProperNameTextType">CA</ns2:LocationState><ns2:LocationPostalCode>93721</ns2:LocationPostalCode><ns9:LocationType>ML</ns9:LocationType></ns2:StructuredAddress></ns2:ContactMeans><ns2:ContactTelephoneNumber><ns2:TelephoneNumberRepresentation xsi:type="ns8:NANPTelephoneNumberExt"><ns2:TelephoneLineID>5594418721</ns2:TelephoneLineID><ns8:TelephoneType>UNK</ns8:TelephoneType></ns2:TelephoneNumberRepresentation></ns2:ContactTelephoneNumber><ns2:ContactEmailID>test@mail.com</ns2:ContactEmailID></ns2:ContactInformation><ns10:primaryId>79395</ns10:primaryId><ns10:referenceId xsi:nil="true"/><ns10:efmErroneouslySued xsi:nil="true"/><ns10:efmTrueName xsi:nil="true"/><ns10:efmFeeExemptionRequestType xsi:nil="true"/><ns10:efmFeeExemptionType xsi:nil="true"/><ns10:firstAppearancePaid xsi:nil="true"/><ns10:efspFirstAppearancePaid xsi:nil="true"/><ns10:efmInterpreterLanguage xsi:nil="true"/><ns11:AssignmentRole>ATT</ns11:AssignmentRole><ns11:DateAssigned><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-26T17:59:11.400-07:00</ns2:DateRepresentation></ns11:DateAssigned></ns10:CaseParticipantExt></ns4:CaseAugmentation><ns15:JurisdictionalGroundsCode>NA</ns15:JurisdictionalGroundsCode><ns16:Complaint ns1:id="66664"><ns2:CaseTitleText/><ns2:CaseCategoryText>212120</ns2:CaseCategoryText><ns2:CaseTrackingID>66664</ns2:CaseTrackingID><ns2:CaseDocketID/><ns4:CaseAugmentation><ns10:CaseParticipantExt ns1:id="86837"><ns2:EntityPerson xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:id="103461" xsi:type="ns4:PersonType"><ns2:PersonName><ns2:PersonGivenName>AutoAccept</ns2:PersonGivenName><ns2:PersonMiddleName/><ns2:PersonSurName>TestPerson</ns2:PersonSurName><ns2:PersonNameSuffixText/></ns2:PersonName></ns2:EntityPerson><ns4:CaseParticipantRoleCode>APLNT</ns4:CaseParticipantRoleCode><ns10:primaryId>86837</ns10:primaryId><ns10:referenceId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmErroneouslySued xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmTrueName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmFeeExemptionRequestType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmFeeExemptionType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:firstAppearancePaid xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efspFirstAppearancePaid xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmInterpreterLanguage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:nonMonApplication>ANY</ns10:nonMonApplication></ns10:CaseParticipantExt><ns10:CaseParticipantExt ns1:id="86838"><ns2:EntityPerson xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:id="103462" xsi:type="ns4:PersonType"><ns2:PersonName><ns2:PersonGivenName>Opposing</ns2:PersonGivenName><ns2:PersonMiddleName/><ns2:PersonSurName>TestPerson</ns2:PersonSurName><ns2:PersonNameSuffixText/></ns2:PersonName></ns2:EntityPerson><ns4:CaseParticipantRoleCode>AGENCY</ns4:CaseParticipantRoleCode><ns10:primaryId>86838</ns10:primaryId><ns10:referenceId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmErroneouslySued xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmTrueName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmFeeExemptionRequestType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmFeeExemptionType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:firstAppearancePaid xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efspFirstAppearancePaid xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:efmInterpreterLanguage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns10:nonMonApplication>ANY</ns10:nonMonApplication></ns10:CaseParticipantExt></ns4:CaseAugmentation><ns16:CaseAugmentationExt><ns3:CaseCourtEvent xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns4:CourtEventType"><ns2:ActivityDateRepresentation xsi:type="ns2:DateType"><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:ActivityDateRepresentation><ns2:ActivityDescriptionText>COMPLAINT_FILED</ns2:ActivityDescriptionText></ns3:CaseCourtEvent><ns3:CaseCourtEvent xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns4:CourtEventType"><ns2:ActivityDateRepresentation xsi:type="ns2:DateType"><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:ActivityDateRepresentation><ns2:ActivityDescriptionText>DOCUMENT_ENTRY</ns2:ActivityDescriptionText><ns4:CourtEventDocument complaintType="66664" xsi:type="ns18:CourtEventDocumentTypeExt"><ns2:DocumentDescriptionText>Application/Declaration: TRO </ns2:DocumentDescriptionText><ns2:DocumentEffectiveDate><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:DocumentEffectiveDate><ns2:DocumentFiledDate><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:DocumentFiledDate><ns2:DocumentIdentification><ns2:IdentificationID xsi:type="ns2:TextType">218620</ns2:IdentificationID></ns2:DocumentIdentification><ns2:DocumentStatus><ns2:StatusText>REJ</ns2:StatusText></ns2:DocumentStatus><ns18:DocumentDisposition xsi:nil="true"/><ns18:EfmReferenceId>116930</ns18:EfmReferenceId></ns4:CourtEventDocument></ns3:CaseCourtEvent></ns16:CaseAugmentationExt></ns16:Complaint><ns16:CaseTypeText>211110</ns16:CaseTypeText><ns16:CaseAugmentationExt><ns3:CaseCourtEvent xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns4:CourtEventType"><ns2:ActivityDateRepresentation xsi:type="ns2:DateType"><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:ActivityDateRepresentation><ns2:ActivityDescriptionText>CASE_FILED</ns2:ActivityDescriptionText></ns3:CaseCourtEvent><ns16:incidentAddress><ns2:StructuredAddress><ns2:LocationPostalCode>MA</ns2:LocationPostalCode></ns2:StructuredAddress></ns16:incidentAddress><ns16:relatedDocumentParticipants><ns16:associationType>FILEDBY</ns16:associationType><ns16:document ns1:ref="116930"/><ns16:relatedParticipant ns1:ref="86837"/></ns16:relatedDocumentParticipants><ns16:relatedDocumentParticipants><ns16:associationType>REFERS_TO</ns16:associationType><ns16:document ns1:ref="116930"/><ns16:relatedParticipant ns1:ref="86838"/></ns16:relatedDocumentParticipants><ns16:relatedCaseAssignments><ns16:associationType>REPRESENTEDBY</ns16:associationType><ns16:participant ns1:ref="86837"/><ns16:relatedCaseAssignment ns1:ref="caseAssignment-79395"/></ns16:relatedCaseAssignments></ns16:CaseAugmentationExt></ns16:CivilCaseExt><ns4:FilingStatus><ns4:FilingStatusCode>REJECTED</ns4:FilingStatusCode></ns4:FilingStatus><ns30:ReviewedLeadDocument ns1:id="116930"><ns2:DocumentBinary><ns2:BinaryFormatStandardName>application/pdf</ns2:BinaryFormatStandardName><ns2:BinaryLocationURI>https%3A%2F%2Fca-madera-efm-aux.s3.us-gov-west-1.amazonaws.com%2F211110%2FEFILE-00004491%2F791eb8e4-8e2b-4b81-bd67-fcefa6eaf3b10.pdf%3FX-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Date%3D20260427T010021Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D604800%26X-Amz-Credential%3DAKIATZAYMLVTEOCLRNFW%252F20260427%252Fus-gov-west-1%252Fs3%252Faws4_request%26X-Amz-Signature%3Dbd20bafe285cad32ef15fe08b2b884cdf3ec7719a0d914283769817b4dcb0d90</ns2:BinaryLocationURI></ns2:DocumentBinary><ns2:DocumentDescriptionText>Application/Declaration: TRO </ns2:DocumentDescriptionText><ns2:DocumentFileControlID>doc-586990e33d97453e88dffa8f71107ea6</ns2:DocumentFileControlID><ns2:DocumentFiledDate><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:DocumentFiledDate><ns2:DocumentIdentification><ns2:IdentificationID>218620</ns2:IdentificationID></ns2:DocumentIdentification><ns2:DocumentReceivedDate><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns84:dateTime">2026-04-26T17:59:11.427-07:00</ns2:DateRepresentation></ns2:DocumentReceivedDate><ns2:DocumentStatus><ns2:StatusText>REJ</ns2:StatusText><ns2:StatusDate><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns84:dateTime">2026-04-27T00:00:00.000-07:00</ns2:DateRepresentation></ns2:StatusDate></ns2:DocumentStatus><ns30:DocumentFilingStatus><ns31:DocumentFilingStatusCode>Rejected</ns31:DocumentFilingStatusCode><ns2:StatusDescriptionText xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></ns30:DocumentFilingStatus><ns30:dateReceived><ns2:DateRepresentation xmlns:ns84="http://niem.gov/niem/proxy/xsd/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns84:dateTime">2026-04-26T17:59:11.427-07:00</ns2:DateRepresentation></ns30:dateReceived></ns30:ReviewedLeadDocument><ns28:FeesCalculation><ns32:FeesCalculationAmount>0</ns32:FeesCalculationAmount><ns4:Error><ns4:ErrorCode>0</ns4:ErrorCode><ns4:ErrorText>No Error</ns4:ErrorText></ns4:Error></ns28:FeesCalculation></ns28:ReviewFilingCallbackMessageExt></ns70:NotifyFilingReviewCompleteRequestMessage></soap:Body></soap:Envelope>